In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('com.csv')

In [4]:
type(data)

pandas.core.frame.DataFrame

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [7]:
data.describe()

           Salary
count    6.000000
mean   125.000000
std     82.158384
min     50.000000
25%     62.500000
50%    100.000000
75%    175.000000
max    250.000000

In [9]:
data

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [10]:
data.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [11]:
data['Name']

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [17]:
data[:, 1]

TypeError: '(slice(None, None, None), 1)' is an invalid key

In [23]:
data.iloc[[1], [3]]

   Salary
1      50

In [31]:
data['Salary'].mean()

125.0